<a href="https://colab.research.google.com/github/Alicia-a19/TADM-MUMADE/blob/main/TADM2022_S03b_Consultas_SQL_(Clase).ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# CONSULTAS SQL

Estudiante: Alicia Megía Ortega

Enlaces para entender la base de datos y las relaciones entre las tablas existentes en esta.

[Guia al Conjunto de Datos](https://sorry.vse.cz/~berka/challenge/pkdd1999/berka.htm)

[Extracto del Diseño](https://dbdesigner.page.link/7iRemaQAUMsbFb2o7)


Antes de empezar cargamos nuestro archivo data_berka en nuestro entorno: [enlace](https://sorry.vse.cz/~berka/challenge/pkdd1999/berka.htm)

Acceso a la base de datos.

In [2]:
!gdown --id 1Osmr7qVN0NMuqYxvLesNn7H4nqPCVbsU

/usr/local/lib/python3.7/dist-packages/gdown/cli.py:131: FutureWarning: Option `--id` was deprecated in version 4.3.1 and will be removed in 5.0. You don't need to pass it anymore to use a file ID.
  category=FutureWarning,
Downloading...
From: https://drive.google.com/uc?id=1Osmr7qVN0NMuqYxvLesNn7H4nqPCVbsU
To: /content/data_berka.db
100% 70.2M/70.2M [00:00<00:00, 103MB/s]

En primer lugar cargamos la extensión que nos va permitir manejar comandos sql directamente en colab

Carga de la extensión de sql

In [3]:
%load_ext sql

Y conectamos con la base de datos

In [4]:
%sql sqlite:///data_berka.db

'Connected: @data_berka.db'

Comprobamos esquema

Tener abierto el diseño y donde se describen los datos

Muestra el nombre de la tabla y el tipo (que ha de ser tabla)

In [ ]:
%%sql
SELECT name,type
FROM sqlite_master
WHERE type == 'table' -- or = 'table'

 * sqlite:///data_berka.db
Done.

[('DISTRICT', 'table'),
 ('ACCOUNT', 'table'),
 ('TRANS', 'table'),
 ('CLIENT', 'table'),
 ('DISPOSITION', 'table'),
 ('CREDIT_CARD', 'table'),
 ('LOAN', 'table'),
 ('PERMANENT_ORDER', 'table')]

## Consultas sobre Préstamos

Consulta SELECT < lista de columnas >  
         FROM < T1, T2, .., TN >  
         WHERE < condición >

SELECT column_1, column_2, column_N   
FROM table_name   
WHERE expression;

NOT   
* != Not Equal to
* <>	Not Equal to

1. Obtener todos los atributos que tiene el banco sobre sús prestamos.

(extra limitar a 20 registros)

Añadir LIMIT 20

%sql una sola línea (afectaría solo a la propia línea)  
%%sql toda la celda

SELECT * para obtener todos los atributos al no especificar  
Se podría especificar para obtener solo algunos

In [ ]:
%%sql 
SELECT *
FROM LOAN
LIMIT 20

 * sqlite:///data_berka.db
Done.

[(5314, 1787, 930705, 96396, 12, 8033, 'B'),
 (5316, 1801, 930711, 165960, 36, 4610, 'A'),
 (6863, 9188, 930728, 127080, 60, 2118, 'A'),
 (5325, 1843, 930803, 105804, 36, 2939, 'A'),
 (7240, 11013, 930906, 274740, 60, 4579, 'A'),
 (6687, 8261, 930913, 87840, 24, 3660, 'A'),
 (7284, 11265, 930915, 52788, 12, 4399, 'A'),
 (6111, 5428, 930924, 174744, 24, 7281, 'B'),
 (7235, 10973, 931013, 154416, 48, 3217, 'A'),
 (5997, 4894, 931104, 117024, 24, 4876, 'A'),
 (7121, 10364, 931110, 21924, 36, 609, 'A'),
 (6077, 5270, 931122, 79608, 24, 3317, 'A'),
 (6228, 6034, 931201, 464520, 60, 7742, 'B'),
 (6356, 6701, 931208, 95400, 36, 2650, 'A'),
 (5523, 2705, 931208, 93888, 36, 2608, 'A'),
 (6456, 7123, 931209, 47016, 12, 3918, 'A'),
 (7104, 10320, 931213, 259740, 60, 4329, 'A'),
 (6820, 9034, 931216, 38148, 12, 3179, 'A'),
 (6876, 9236, 931221, 86616, 12, 7218, 'A'),
 (7097, 10266, 931223, 75624, 24, 3151, 'B')]

2. Obtener los campos de fecha (date), cantidad (amount), duración (duration), pagos (payments), estado (status)

(extra limitar a 20 registros)

Limitar a sólo algunos campos indicando el nombre de los mismos  
Ordenar ORDER BY (ASC predeterminado)  
Por lo tanto, se ha de poner DESC (no predeterminado)

SELECT column-list   
FROM table_name   
WHERE condition
ORDER BY column1, column2, .. column_N [ASC | DESC];

In [ ]:
%%sql
SELECT date, amount, duration, payments, status
FROM LOAN
ORDER BY amount DESC
LIMIT 20

3. Obtener los distintos tipos de estado que se presentan en un préstamo.

DISTINCT para que devuelva filas sin repetir



*   The SELECT DISTINCT statement is used to return only distinct (different) values.

SELECT DISTINCT column_1, column_2,.....column_N   
FROM table_name  
WHERE conditions;

In [ ]:
%%sql 
SELECT DISTINCT status
FROM LOAN
ORDER BY status

 * sqlite:///data_berka.db
Done.

[('A',), ('B',), ('C',), ('D',)]

In [ ]:
%%sql
SELECT COUNT(DISTINCT status)
FROM LOAN

 * sqlite:///data_berka.db
Done.

[(4,)]

DISTINCT

In [ ]:
%%sql
SELECT DISTINCT A2
FROM DISTRICT
ORDER BY A2 DESC

 * sqlite:///data_berka.db
(sqlite3.OperationalError) near "20": syntax error
[SQL: SELECT TOP 20
FROM LOAN]
(Background on this error at: https://sqlalche.me/e/14/e3q8)

In [ ]:
%%sql
SELECT COUNT(DISTINCT A2)
FROM DISTRICT

 * sqlite:///data_berka.db
Done.

[(77,)]

4. Obtener solo los prestamos ya terminados.

WHERE permite filtrar
A y B están finalizados

In [ ]:
%%sql
SELECT *
FROM LOAN
WHERE status IN ("A", "B")
LIMIT 100

5. Ordenar lo anterior por duración y cantidad

extra: limitar a 20 elementos

In [ ]:
%%sql
SELECT *
FROM LOAN
WHERE status IN ("A", "B")
ORDER BY duration, amount DESC 
LIMIT 20

 * sqlite:///data_berka.db
Done.

[(6934, 9494, 970209, 116832, 12, 9736, 'A'),
 (5002, 173, 940531, 104808, 12, 8734, 'A'),
 (4986, 97, 970810, 102876, 12, 8573, 'A'),
 (5375, 2106, 961003, 101520, 12, 8460, 'A'),
 (7253, 11079, 970426, 98304, 12, 8192, 'A'),
 (6998, 9833, 940521, 97632, 12, 8136, 'A'),
 (6612, 7907, 970831, 97392, 12, 8116, 'A'),
 (5314, 1787, 930705, 96396, 12, 8033, 'B'),
 (6995, 9814, 960926, 96168, 12, 8014, 'A'),
 (5464, 2419, 950130, 95808, 12, 7984, 'A'),
 (5643, 3273, 970921, 94512, 12, 7876, 'B'),
 (5377, 2116, 970804, 92400, 12, 7700, 'A'),
 (5519, 2694, 940308, 91632, 12, 7636, 'A'),
 (7046, 10049, 970328, 91632, 12, 7636, 'A'),
 (5868, 4361, 970329, 90156, 12, 7513, 'A'),
 (7277, 11231, 971024, 89280, 12, 7440, 'A'),
 (4996, 132, 961106, 88440, 12, 7370, 'A'),
 (5882, 4427, 940926, 87816, 12, 7318, 'A'),
 (7119, 10361, 970602, 86880, 12, 7240, 'A'),
 (6876, 9236, 931221, 86616, 12, 7218, 'A')]

Cargar el resultado de la sql en un DataFrame de Pandas

In [ ]:
# importar librería
import pandas as pd
# ejecutar sql
df = %sql SELECT * FROM LOAN WHERE status in ("A", "B") ORDER BY duration, amount DESC
# transformar en DataFrame de pandas
df.DataFrame()
# Descargarlo en un archivo .csv
df.DataFrame().to_csv("first_sql.csv")

 * sqlite:///data_berka.db
Done.

Ex. 1

>Plantear otro filtro para los préstamos (por cantidad, duración, status, etc.)

In [ ]:
%%sql
SELECT *
FROM LOAN
WHERE duration = 12
LIMIT 20

OR equivalente a un o  
Una condición u otra

In [ ]:
%%sql
SELECT *
FROM LOAN
WHERE amount > 80000 OR duration > 24 OR status = "C"
ORDER BY amount DESC
LIMIT 20

AND equivalente a un Y  
Ambas condiciones

In [ ]:
%%sql
SELECT *
FROM LOAN
WHERE amount BETWEEN 100000 AND 110000
ORDER BY account_id, amount
LIMIT 20

Para buscar filas que están en una lista de valores  
in (' ', ' ')

In [ ]:
%%sql
SELECT *
FROM LOAN
WHERE amount < 9000 AND status IN ('A', 'C') 
ORDER BY duration
LIMIT 20

LIKE '%cadena%'  
Permite filtrar por cadenas de caracteres o numéricas

In [ ]:
%%sql
SELECT *
FROM LOAN
WHERE amount > 9000 AND account_id LIKE '%952%'
ORDER BY duration
LIMIT 20

 * sqlite:///data_berka.db
Done.

[(6216, 5952, 940930, 141240, 24, 5885, 'A')]

FILTRAR POR PARTE DE CADENA 
Filtrar en tabla DISTRICT

In [ ]:
%%sql
SELECT *
FROM DISTRICT
WHERE A3 LIKE '%Pr%'
LIMIT 20

 * sqlite:///data_berka.db
Done.

[(1, 'Hl.m. Praha', 'Prague', 1204953, 0, 0, 0, 1, 1, 100.0, 12541, 0.29, 0.43, 167, 85677, 99107)]

The SQL MIN() and MAX() Functions

* The MIN() function returns the smallest value of the selected column.

* The MAX() function returns the largest value of the selected column.

In [ ]:
%%sql
SELECT MIN(amount) AS mincredit, MAX(amount) as maxcredit
FROM LOAN

 * sqlite:///data_berka.db
Done.

[(4980, 590820)]

 Ex. 2 

> Seleccionar fecha, cantidad, duración y pagos de aquellos préstamos que han sido terminados con una duración mayor de 12 meses ordenados de mayor a menor cantidad de dinero.

>extra: volcar en un DataFrame

In [ ]:
%%sql
SELECT date, amount, duration, payments
FROM LOAN
WHERE status in ("A", "B") AND duration > 12
ORDER BY amount DESC

¿Cuántos registros cumplen esa condición tiene?

count(*) permite contar las filas (registros, observaciones)

In [ ]:
%%sql
SELECT count(*)
FROM LOAN
WHERE status IN ("A", "B") AND duration > 12

 * sqlite:///data_berka.db
Done.

[(131,)]

¿Cuántos préstamos hay en ejecución (running) con duración entre 24 y 48 meses? (ambos inclusive)

BETWEEN coge los extremos de los intervalos

In [ ]:
%%sql
SELECT count(*)
FROM LOAN
WHERE status IN ("C", "D") AND duration BETWEEN 24 AND 48

 * sqlite:///data_berka.db
Done.

[(279,)]

In [ ]:
%%sql
SELECT count(*)
FROM LOAN
WHERE status IN ("C", "D") AND duration >= 24 AND duration <= 48

 * sqlite:///data_berka.db
Done.

[(279,)]

## Group By

7. ¿Cuántos préstamos hay por cada estado y cual es la media de la cantidad de dinero prestado?

En SELECT se ha de poner por donde se va a agrupar. Debe existir una coherencia entre el select y el group by 

sql permite que el nombre que se ponga se asigne a la columna. También es posible ponerlo con as  

HAVING se utiliza sobre los grupos obtenidos tras la propia consulta (group by)

- WHERE: se filtran los registros antes de agruparlos  
- HAVING: se filtran los grupos tras haberlos obtenido

Having: Especifica una condición de búsqueda para un grupo o agregado. HAVING solo se puede utilizar con la instrucción SELECT. Normalmente, HAVING se usa con una cláusula GROUP BY. Cuando no se usa GROUP BY, hay un solo grupo implícito agregado.

avg(variable) para realizar la media aritmética



*   The COUNT() function returns the number of rows that matches a specified criterion.
*   The AVG() function returns the average value of a numeric column. 
*   The SUM() function returns the total sum of a numeric column.

In [ ]:
%%sql
SELECT status, count(*) as total, avg(amount)
FROM LOAN
WHERE duration >= 24
GROUP BY status
HAVING total > 25
ORDER BY total DESC

 * sqlite:///data_berka.db
Done.

[('C', 376, 180343.1489361702),
 ('A', 110, 122425.2),
 ('D', 44, 254127.27272727274)]

8. Por cada Región, quiero contar el número de ciudades y obtener el total del número de habitantes de la región

extra: no considerar la región de Praga

- COUNT() para contar cuantas filas cointienen un valor no nulo de una variable (columna) específica.
- SUM() cuando se desea saber la suma total de los valores de una columna

In [ ]:
%%sql
SELECT A3, count(A2) AS no_districts, count(A9) AS no_cities, sum(A4) AS total_hab
FROM DISTRICT
GROUP BY A3
HAVING no_districts > 1

 * sqlite:///data_berka.db
Done.

[('central Bohemia', 12, 12, 1105234),
 ('east Bohemia', 11, 11, 1234781),
 ('north Bohemia', 10, 10, 1178977),
 ('north Moravia', 11, 11, 1970302),
 ('south Bohemia', 8, 8, 700595),
 ('south Moravia', 14, 14, 2054989),
 ('west Bohemia', 10, 10, 859306)]

In [ ]:
%%sql
SELECT A3, count(A2) AS no_districts, count(A9) AS no_cities, sum(A4) AS total_hab
FROM DISTRICT
WHERE NOT A3 = "Prague"
GROUP BY A3

 * sqlite:///data_berka.db
Done.

[('central Bohemia', 12, 12, 1105234),
 ('east Bohemia', 11, 11, 1234781),
 ('north Bohemia', 10, 10, 1178977),
 ('north Moravia', 11, 11, 1970302),
 ('south Bohemia', 8, 8, 700595),
 ('south Moravia', 14, 14, 2054989),
 ('west Bohemia', 10, 10, 859306)]

9. Contar ordenes permanentes (domiciliaciones) por banco y tipo de transacción

In [ ]:
%%sql
SELECT bank_to, k_symbol, count(*) AS c
FROM PERMANENT_ORDER
WHERE amount < 500
GROUP BY bank_to, k_symbol
ORDER BY bank_to

 * sqlite:///data_berka.db
Done.

[('AB', ' ', 20),
 ('AB', 'POJISTNE', 16),
 ('AB', 'SIPO', 17),
 ('CD', ' ', 34),
 ('CD', 'POJISTNE', 11),
 ('CD', 'SIPO', 18),
 ('EF', ' ', 23),
 ('EF', 'POJISTNE', 21),
 ('EF', 'SIPO', 10),
 ('EF', 'UVER', 1),
 ('GH', ' ', 31),
 ('GH', 'LEASING', 1),
 ('GH', 'POJISTNE', 17),
 ('GH', 'SIPO', 16),
 ('GH', 'UVER', 4),
 ('IJ', ' ', 35),
 ('IJ', 'POJISTNE', 19),
 ('IJ', 'SIPO', 15),
 ('KL', ' ', 31),
 ('KL', 'LEASING', 1),
 ('KL', 'POJISTNE', 15),
 ('KL', 'SIPO', 15),
 ('KL', 'UVER', 2),
 ('MN', ' ', 24),
 ('MN', 'LEASING', 1),
 ('MN', 'POJISTNE', 20),
 ('MN', 'SIPO', 9),
 ('MN', 'UVER', 1),
 ('OP', ' ', 28),
 ('OP', 'POJISTNE', 23),
 ('OP', 'SIPO', 11),
 ('QR', ' ', 19),
 ('QR', 'POJISTNE', 18),
 ('QR', 'SIPO', 20),
 ('QR', 'UVER', 1),
 ('ST', ' ', 32),
 ('ST', 'POJISTNE', 17),
 ('ST', 'SIPO', 16),
 ('ST', 'UVER', 2),
 ('UV', ' ', 30),
 ('UV', 'POJISTNE', 15),
 ('UV', 'SIPO', 11),
 ('UV', 'UVER', 1),
 ('WX', ' ', 24),
 ('WX', 'POJISTNE', 25),
 ('WX', 'SIPO', 15),
 ('YZ', ' ', 28),
 ('YZ', 'LEASING', 2),
 ('YZ', 'POJISTNE', 20),
 ('YZ', 'SIPO', 14),
 ('YZ', 'UVER', 1)]

# JOIN

inner join () realiza una intersección entre las dos tablas

10. ¿Cuántas cuentas de frecuencia mensual tienen un un préstamo activo?

Cuando los atributos se encuentran en ambas tablas les cambia el nombre para identificarlos  
La tabla DISTRICT se relaciona con ACCOUNT mediante district_id  
La tabla disposition es la tabla puente entre account y client

In [ ]:
%%sql
SELECT count(*) --loan_id, A4, A9, A10, A11, c.birth_number, l.date loan_date, amount, duration, payments, frequency, a.date acc_date, status
FROM LOAN l, ACCOUNT a, DISTRICT d, CLIENT c, DISPOSITION dp
WHERE l.account_id = a.account_id
  AND a.district_id = d.A1
  AND dp.account_id = a.account_id -- join account/disposition
  AND dp.client_id = c.client_id -- join disposition/client
-- AND status in ("A", "B")
ORDER BY amount DESC, a.date DESC
LIMIT 10

 * sqlite:///data_berka.db
Done.

[(827,)]

El número de cuentas aumenta al establecer la tabla con clientes y cuentas pues es una relación N:N y puede haber más de una cuenta por cliente

In [ ]:
%%sql
SELECT DISTINCT TYPE FROM DISPOSITION

 * sqlite:///data_berka.db
Done.

[('OWNER',), ('DISPONENT',)]

Filtrado por propietarios  
El resultado vuelve a ser 682 (número total de créditos)

In [ ]:
%%sql
SELECT count(*) --loan_id, A4, A9, A10, A11, c.birth_number, l.date loan_date, amount, duration, payments, frequency, a.date acc_date, status
FROM LOAN l, ACCOUNT a, DISTRICT d, CLIENT c, DISPOSITION dp
WHERE l.account_id = a.account_id
  AND a.district_id = d.A1
  AND dp.account_id = a.account_id -- join account/disposition
  AND dp.client_id = c.client_id -- join disposition/client
  AND dp.type = "OWNER"
-- AND status in ("A", "B")
-- ORDER BY amount DESC, a.date DESC
-- LIMIT 10

Extracción (sustraer): SUBSTR (extracción de caracteres)
SUBSTR(0,3) la numeración comienza en 0 y el 3 no inclusivo  
Extracción de números enteros: división (cifras al comienzo), resto (cifras finales)

In [ ]:
%%sql
SELECT loan_id, A4, A9, A10, A11, c.birth_number, SUBSTR(c.birth_number,0,3) birth_year, l.date loan_date, 
  amount, duration, payments, frequency, a.date acc_date, status
FROM LOAN as l, ACCOUNT as a, DISTRICT as d, CLIENT as c, DISPOSITION as dp
WHERE l.account_id = a.account_id
  AND a.district_id = d.A1
  AND dp.account_id = a.account_id -- join account/disposition
  AND dp.client_id = c.client_id -- join disposition/client
  AND status in ("A", "B")
ORDER BY amount DESC, a.date DESC
LIMIT 10

 * sqlite:///data_berka.db
Done.

[(6228, 77963, 4, 51.5, 8546, '406202', '40', 931201, 464520, 60, 7742, 'weekly', 930319, 'B'),
 (6038, 1204953, 1, 100.0, 12541, '406015', '40', 940810, 323472, 48, 6739, 'monthly', 930621, 'A'),
 (5918, 67298, 7, 43.8, 8561, '640313', '64', 940604, 300204, 36, 8339, 'monthly', 930605, 'A'),
 (5395, 106054, 6, 63.1, 8110, '666210', '66', 940730, 299088, 36, 8308, 'monthly', 930606, 'B'),
 (6526, 86513, 5, 50.5, 8288, '586026', '58', 950103, 288468, 36, 8013, 'monthly', 940829, 'A'),
 (6232, 124605, 8, 46.0, 8772, '490518', '49', 940708, 276660, 36, 7685, 'monthly', 930828, 'B'),
 (7240, 1204953, 1, 100.0, 12541, '780907', '78', 930906, 274740, 60, 4579, 'weekly', 930214, 'A'),
 (6244, 1204953, 1, 100.0, 12541, '371104', '37', 950108, 270648, 36, 7518, 'weekly', 940307, 'B'),
 (6725, 51428, 4, 52.7, 8402, '485828', '48', 950623, 265320, 36, 7370, 'monthly', 930918, 'A'),
 (6725, 51428, 4, 52.7, 8402, '501204', '50', 950623, 265320, 36, 7370, 'monthly', 930918, 'A')]

11. Domiciliaciones en cuentas de actualización semanal de alquiler en cuentas de Praga

In [ ]:
%%sql
SELECT order_id, p.account_id, amount
FROM PERMANENT_ORDER as p, ACCOUNT as a, DISTRICT as d
WHERE p.account_id = a.account_id
  AND a.district_id = d.A1
  AND k_symbol = "LEASING"
  AND frequency = "weekly"
  AND A3 = "Prague"

 * sqlite:///data_berka.db
Done.

[(29514, 72, 2923),
 (30250, 573, 2249),
 (30944, 1056, 2531.7),
 (34056, 3141, 1087),
 (35237, 3959, 1680.6),
 (40429, 7465, 1060.6)]


12. Domiciliaciones (*órdenes*) semanales para alquiler (*leasing*) en cuentas de Praga

 - Ordenes permanentes de alquiler (*leasing*) y semanales (*weekly*)
 - Relación con cuentas que tienen región Praga

In [ ]:
%%sql
SELECT order_id, k_symbol, bank_to, a.account_id, a.frequency, d.A2, d.A3
FROM PERMANENT_ORDER as p, ACCOUNT as a, DISTRICT as d
WHERE p.account_id = a.account_id
  AND a.district_id = d.A1
  AND k_symbol = "LEASING" 
  AND a.frequency = "weekly" 
  AND d.A3 = "Prague"

 * sqlite:///data_berka.db
Done.

[(29514, 'LEASING', 'OP', 72, 'weekly', 'Hl.m. Praha', 'Prague'),
 (30250, 'LEASING', 'CD', 573, 'weekly', 'Hl.m. Praha', 'Prague'),
 (30944, 'LEASING', 'IJ', 1056, 'weekly', 'Hl.m. Praha', 'Prague'),
 (34056, 'LEASING', 'OP', 3141, 'weekly', 'Hl.m. Praha', 'Prague'),
 (35237, 'LEASING', 'AB', 3959, 'weekly', 'Hl.m. Praha', 'Prague'),
 (40429, 'LEASING', 'ST', 7465, 'weekly', 'Hl.m. Praha', 'Prague')]

13. Transacciones relacionadas con pensiones (DUCHOD) en Plzen desde el banco MN

(limitar a 10)

In [ ]:
%%sql
SELECT trans_id, a.account_id, a.frequency, t.type, k_symbol, bank
FROM TRANS as t, ACCOUNT as a, DISTRICT as d
WHERE t.account_id = a.account_id 
  AND a.district_id = d.A1
  AND k_symbol = "DUCHOD" 
  AND bank = "MN" 
  AND d.A2 LIKE "%Plzen%"  
LIMIT 10

 * sqlite:///data_berka.db
Done.

[(47969, 161, 'monthly', 'PRIJEM', 'DUCHOD', 'MN'),
 (47970, 161, 'monthly', 'PRIJEM', 'DUCHOD', 'MN'),
 (47971, 161, 'monthly', 'PRIJEM', 'DUCHOD', 'MN'),
 (47972, 161, 'monthly', 'PRIJEM', 'DUCHOD', 'MN'),
 (47973, 161, 'monthly', 'PRIJEM', 'DUCHOD', 'MN'),
 (47974, 161, 'monthly', 'PRIJEM', 'DUCHOD', 'MN'),
 (47975, 161, 'monthly', 'PRIJEM', 'DUCHOD', 'MN'),
 (47976, 161, 'monthly', 'PRIJEM', 'DUCHOD', 'MN'),
 (47977, 161, 'monthly', 'PRIJEM', 'DUCHOD', 'MN'),
 (1098524, 3753, 'monthly', 'PRIJEM', 'DUCHOD', 'MN')]

# Subconsultas

Sub consulta o consultas anidadas o una consulta interna está incrustado en la consulta cláusula WHERE dentro de otra consulta SQLite.  

La siguiente es una subconsulta varias reglas que se deben seguir:

* Subconsultas deben ir entre paréntesis.

* Sub-consulta cláusula SELECT sólo puede tener una columna, a menos que múltiples columnas en la consulta principal, la comparación columna sub consulta seleccionada.

* ORDER BY no se puede utilizar en una subconsulta, aunque la consulta principal puede utilizar ORDER BY. Se puede utilizar el GROUP BY en subconsultas, funciona igual que el ORDER BY.

* subconsulta retorna más de una línea, sólo se pueden utilizar con el operador de valores múltiples, tales como el operador IN.

* ENTRE operador no se puede utilizar con sub-consultas, sin embargo, entre puede ser utilizado dentro de subconsultas.

14. Prestamos cuya cantidad es superior a la media de los clientes de Praga

subconsulta instrucción SELECT

SELECT nombre_columna [, COLUMN_NAME]  
De la Tabla1 [, tabla2]  
Donde el operador COLUMN_NAME  
    (SELECT nombre_columna [, COLUMN_NAME]  
     De la Tabla1 [, tabla2]  
     [Cuando])

- Cantidad media prestada a los cuentas de Praga

In [ ]:
%%sql
SELECT avg(l.amount)
FROM LOAN l, ACCOUNT a, DISTRICT d
WHERE l.account_id = a.account_id
AND a.district_id = d.A1
AND d.A3 = "Prague"

 * sqlite:///data_berka.db
Done.

[(153957.2857142857,)]

- Consultar los préstamos superiores a esa cantidad

In [ ]:
%%sql
SELECT count(*)
FROM LOAN
WHERE amount > (SELECT avg(l.amount)
                FROM LOAN l, ACCOUNT a, DISTRICT d
                WHERE l.account_id = a.account_id
                AND a.district_id = d.A1
                AND d.A3 = "Prague")

 * sqlite:///data_berka.db
Done.

[(277,)]

# Repaso de Join/Group By

## Objetivo 2.1

15 . Clientes de Praga con préstamos según su estado

- ¿Cuántos clientes hay en Praga?
- ¿Cuántas cuentas tienen asociados clientes en Praga?
- ¿cuántas de esas cuentas tienen asociados un préstamo?
- Necesito saber cuántos hay por cada estado (*status*)

In [ ]:
%%sql 
SELECT status, count(*)
FROM CLIENT c, DISTRICT d, DISPOSITION dp, LOAN l 
WHERE c.district_id = d.A1 AND c.client_id = dp.client_id
  AND l.account_id = dp.account_id AND d.A3 = "Prague"
GROUP BY status

 * sqlite:///data_berka.db
Done.

[('A', 37), ('B', 3), ('C', 55), ('D', 3)]

## Ejercicio

> cantidad de dinero medio en transacciones de clientes propietarios de cuentas en Kolin (owned accounts)

In [ ]:
%%sql
SELECT c.client_id, AVG (amount) AS Average
FROM client as c, district as d, disposition as dp, account as a, trans as t
WHERE c.district_id = d.A1 AND c.client_id = dp.client_id
  AND dp.account_id = a.account_id AND a.account_id = t.account_id
  AND d.A2 = "Kolin" AND dp.type = "OWNER" 
GROUP BY c.client_id
ORDER BY Average DESC
LIMIT 10

 * sqlite:///data_berka.db
Done.

[(5249, 15611.831578947369),
 (3378, 14803.997402597402),
 (1388, 14464.587096774194),
 (6803, 13825.125153374232),
 (8091, 13227.722338204592),
 (3298, 13074.464857881138),
 (1806, 13037.759375),
 (4331, 12644.448051948051),
 (4974, 12023.291743119267),
 (3080, 11784.50460251046)]

> sanction interest if negative balance Cesky Krumlov


> stands for loan payment in Praha from the bank EF

# Extra: Left Join

1. ¿Cuántas cuentas hay? 4500
2. ¿Cuántas cuentas hay con préstamos? (inner join) 682
3. Cuentas con los datos de los préstamos si los hay
4. los ordenamos por cantidad

In [6]:
%%sql
SELECT COUNT(account_id)
FROM ACCOUNT

 * sqlite:///data_berka.db
Done.

[(4500,)]

In [ ]:
%%sql 
SELECT COUNT(a.account_id)
FROM ACCOUNT AS a INNER JOIN LOAN AS l ON a.account_id = l.account_id

In [ ]:
%%sql 
SELECT COUNT(a.account_id)
FROM ACCOUNT AS a, LOAN AS l
WHERE a.account_id = l.account_id

In [ ]:
%%sql 
SELECT a.account_id, a.date, l.amount, l.status, l.payments, l.duration
FROM LOAN AS L LEFT JOIN ACCOUNT AS a ON a.account_id = l.account_id

In [ ]:
%%sql 
SELECT a.account_id, a.date, l.amount, l.status, l.payments, l.duration
FROM ACCOUNT a INNER JOIN LOAN l ON a.account_id = l.account_id
ORDER BY amount DESC

# DataSets

---

Dataset sobre las transacciones con Vyskov, extrayendo los años de las diferentes fechas.

In [ ]:
%%sql dataset << SELECT substr(a.date,0,3) acc_year, substr(t.date, 0, 3) year,amount, balance, k_symbol
FROM ACCOUNT a, TRANS t, DISTRICT d
WHERE a.district_id = d.A1 and d.A2 = "Vyskov"
AND a.account_id = t.account_id

 * sqlite:///data_berka.db
Done.
Returning data to local variable dataset

In [ ]:
dataset.DataFrame().to_csv("dataset.csv")